{
  "mentor": [
    { 
      "mentor_id"="1",
      "mentor_name": "Name: Prof. Kunal Kumar Singh",
      "designation":"Assistant Professor",
      "department": "Applied Sciences and Humanities",
      "description":"Prof. Kunal K. Singh is an alumnus of ISM-Dhanbad. He specializes in Mechanical Engineering. In his half a decade’s of teaching career he has taught subjects like Engg. Mechanics, Manufacturing Processes, T.O.M, D.O.M and Manufacturing Science. He has three research papers in internationals and national journals and proceedings to her credit. His interest lies in Mechanics and Machines. Prof. Kunal loves reading novels, watching news, making caricatures, and listening to music.",
      "mentor_image": ""
    },
    { 
      "mentor_id"="2",
      "mentor_name": "Dr. Gauri Katiyar",
      "designation": "Associate Professor",
      "department":"Applied Sciences and Humanities",
      "description": "Dr. Gauri Katiyar graduated from Government Engineering College(NIT  Raipur) with a Bachelor of Engineering degree in the field of Electrical Engineering (Hons.) in 1988, thereafter pursuing Master of Technology in Digital Communication from Uttar Pradesh Technical University, Lucknow (U.P.). She has also completed her doctorate from Department of Electrical Engineering, Faculty of Engineering and Technology, Jamia Millia Islamia, New Delhi. She has been following her passion of working in the education and academics field since 1991, presently teaching in ITS Engineering College, Greater Noida as a faculty in Department of Electrical and Electronics Engineering. She is also a member of ITSE and IEEE. She is a published author of several books and academic papers, including two books titled ‘Electrical Engineering’ and ‘Fundamentals of Network Analysis and Synthesis’ and papers published in many reputed national and international journals. She has taught various subjects like Basic Electrical Engineering, Networks and Systems, EMMI, BSA, Electrical Machines, Automatic Control System, Elements of Power Systems etc. Apart from teaching, she performs various roles in the institution, including that of an Academic Coordinator, a Student Counselor, and a Member of Discipline Committee. She is actively involved in organizing seminars, conferences and other student related activities in the department. She has also guided B. Tech. students for final year major project. Her research areas include Pattern Recognition, Image Processing and Soft Computing. She loves travelling and listening to music.",
      "mentor_image": ""
    },
    { 
      "mentor_id"="3",
      "mentor_name": " Dr. Renu Choudhary",
      "designation": " Assistant Professor",
      "department": " Applied Sciences and Humanities",
      "description": " Dr. Renu Choudhary is an alumnus of Singhania University, Rajasthan and J. V. Jain College, Saharanpur. She specializes in Applied Mathematics. In her thirteen years of teaching career she has taught subjects like Engineering Mathematics, Operations Research and Discrete Mathematics. She has published three research papers at national and international level. Dr. Renu is a Gold Medalist in her Masters. She loves reading books, travelling and listening to music.",
      "mentor_image": ""
    },
    {
       "mentor_id"="4",
      "mentor_name": ": Dr. Nidhi Puri",
      "designation": " Assistant Professor",
      "department": "Applied Sciences and Humanities",
      "description": "Dr. Nidhi Puri is an alumnus of Jamia Millia Islamia, New Delhi. Dr. Nidhi completed her B. Sc. in Non-Medical Sciences and M. Sc. in Physics from University of Rajsthan, Jaipur. She has also done M. Tech. in Engineering Physics from G. G. S. Indraprastha University, Delhi. Her research in Physics from Jamia Millia Islamia, New Delhi has been lauded in the academic circles. Dr. Puri likes to listen to songs and writing.",
      "mentor_image": ""
    },
    {
       "mentor_id"="5",
      "mentor_name": "Name: Dr. Arunesh K. Yadav",
      "designation": " Assistant Professor",
      "department": " Applied Sciences and Humanities",
      "description": "Dr. Arunesh K. Yadav is an alumnus of Agra University. He specializes in Condense Matter Physics. In his decade and a half of teaching career he has taught subjects like Engineering Physics and Matter Physics. He was awarded Ph. D. for his contribution in the field of Condense Matter Physics with special focus Equation of State. He has seven research papers in internationals and national journals and proceedings to his credit. His interest lies in Matter Physics. Dr. Arunesh loves to play cricket and listening to music.",
      "mentor_image": ""
    },
    {
       "mentor_id"="6",
      "mentor_name": "Dr. Arti Dua",
      "designation": ": Assistant Professor",
      "department": " Applied Sciences and Humanities",
      "description": "Dr. Arti Dua is an alumnus of Singhania University-Rajasthan and IIT-Delhi. She specializes in Pure Mathematics. In her a decade’s of teaching career she has taught subjects like Engineering Mathematics and Discrete Mathematics at graduate and post-graduate levels. Her area of research has been Fluid Mechanics. She has three research papers in internationals and national journals and proceedings to her credit. Her interest lies in Applied Mathematics. Dr. Arti loves reading books and listening to music.",
      "mentor_image": ""
    },
    {
       "mentor_id"="7",
      "mentor_name": "Prof. Surendra Singh",
      "designation": " Assistant Professor",
      "department": " Applied Sciences and Humanities",
      "description": "Prof. Surendra Singh is an alumnus of Vikram University-Ujjain and Sharda University. He specializes in Astro-Physics. In his eight years of teaching career he has taught subjects like Engineering Physics and Laser Physics. Currently he is pursuing Ph. D. from Sharda University in the field of Conducting Polymer. Prof. Surendra loves playing cricket.",
      "mentor_image": ""
    },
    {
       "mentor_id"="8",
      "mentor_name": "Prof. Mohit K. Saxena",
      "designation": "Assistant Professor",
      "department":" Applied Sciences and Humanities",
      "description": "An alumnus of Nagpur University, Prof. Mohit Kumar Saxena did his B.E. in 1999 & master degree in 2007 from DEVI AHILAYA UNIVERSITY, INDORE. His specialization is in “ENERGY MANAGEMENT”. He is also pursuing Ph.D. in the field of solar technology. He has also having industry experience in the field of “LOW TENSION LINE” & “HIGH TENSION LINE” (220 KV & 400 KV Sub Station). In his Eighteen years of teaching career he has taught various subjects like Basic Electrical Engineering, Control Systems and Power Systems etc. His area of interest is Renewable Energy. He is a member of ISTE & IEEE and has published two research papers at national and international level. Prof. Mohit loves Music & Meditation.",
      "mentor_image": ""
    },
    {
       "mentor_id"="9",
      "mentor_name": "Prof. Ashish Kumar Gupta",
      "designation": " Assistant Professor",
      "department": " Applied Sciences and Humanities",
      "description": "Prof. Ashish Kumar Gupta specializes in software Engineering. He completed his B. Tech in Computer Science & Engineering from Uttar Pradesh Technical University, Lucknow, and earned M. Tech in Computer Science & Engineering from Rajasthan Technical University, Kota. His area of research focuses upon 'Software Engineering'. He has 14 years of teaching experience in Programming Languages, Operating System, Software Engineering, DBMS, Computer organization,  Data Structure, Cryptography and Network Security. Prof. Gupta has published two researched papers in journals and proceedings.His hobbies are listening to music and reading books.",
      "mentor_image": ""
    },
    {
       "mentor_id"="10",
      "mentor_name": "Prof. Abhishek Rai",
      "designation": "Assistant Professor",
      "department": " Applied Sciences and Humanities",
      "description": "Prof. Abhishek Rai has been working as an English as a Second Language (ESL) teacher since 2005. With a teaching career spanning more than 12 years, Prof. Rai is currently working as an Assistant Professor (Professional Communication) in the Department of Applied Science and Humanities. An alumnus of Gauhati University, Assam, he pursued his masters in English Language Teaching with specializations in syllabus designing and teaching methodology. He is a lifetime member of English Language Teachers’ Association of India (ELTAI), Chennai. He has presented 14 research papers in various national and international conferences including IIT Roorkee and IIT Patna and has also participated in seven workshops and four short term courses. He has three research papers publication, five poems and two chapter publications in book to his credit. He has also participated in two national level marathons and one state level quarter marathon. He is also a certified Advance Reiki Healer (Level 1 and 2) under Usui System of Natural Healing.",
      "mentor_image": ""
    },
    {
       "mentor_id"="11",
      "mentor_name": ": Dr. Praveen Chandra Jha",
      "designation": " Associate Professor",
      "department": " Applied Sciences and Humanities",
      "description": "Dr. Praveen Chandra Jha has completed B. Sc. And M.Sc In Chemistry From Gorakhpur University. He got first rank in Post Graduate Diploma in Plastic Processing Technology at Central Institute of Plastic Engineering and Technology (CIPET) Lucknow centre where he was also credited with publishing a Research paper on Polymers and Contact Lenses. He was Research Associate at Indian Lac Research Institute (ICAR’s Institute) Ranchi where he worked on development of Natural resin Shellac based high dielectric strength Insulating Varnishes.He was awarded Ph. D. in 2004 from V. K. S. University in the field of Polymer blends. He has published Nine Research papers in International journals of repute. In his 15 years of teaching carrier He taught Physical Chemistry, Engineering Chemistry, Polymer chemistry and Environmental Science and Engineering.His online video on the topic of Bragg.s Equation uploaded by Vedupro on youtube has more than 1lakh 25thousand views. He loves watching Discovery and BBC earth apart from this he likes writing poetry and listening music in his free time.",
      "mentor_image": ""
    },
    {
       "mentor_id"="12",
      "mentor_name": " Prof. Vivek Kumar",
      "designation": "Assistant Professor",
      "department": "Applied Sciences and Humanities",
      "description": "An alumnus of UPTU-Lucknow, Prof. Vivek Kumar specializes in Mechanical Engineering. In his six years of teaching career he has taught subjects like Manufacturing Processes and SOM. His area of interest lies in Manufacturing Process. Prof. Vivek Kumar loves reading, playing cricket and listenining to music.",
      "mentor_image": ""
    },
    {
       "mentor_id"="13",
      "mentor_name": "Dr. Bhanumati Panda",
      "designation": "Assistant Professor",
      "department": "Applied Sciences and Humanities",
      "description": "Dr. Bhanumati Panda, an alumna of Utkal University, Odisha, is working as an Assistant Professor (Mathematics) in the Department of Applied Science and Humanities. With 18 years of demonstrated teaching experience, she has a good command over teaching numerous subjects like Engineering Mathematics, Operation Research, Numerical Analysis, Complex Analysis, Discrete Mathematics and Statistics. She completed her Ph.D in the field of Applied Mathematics, her thesis being titled “Dispersion in Curved Channel Flow using Multiquadric Radial Basis Function Method” from Gautam Buddha University, Greater Noida. She has a number of research publications and conference proceedings in reputed national and international journals. Her leisure pursuits are listening to music, watching news on current affairs and socializing.",
      "mentor_image": ""
    },
    { 
      "mentor_id"="14",
      "mentor_name": "Dr. Ruchi Srivastava",
      "designation": "Assistant Professor",
      "department": "Applied Sciences and Humanities",
      "description": "Dr. Ruchi is an alumnus of Banaras Hindu University. After graduating from the prestigious Banaras hindu University Dr. Ruchi was awarded her Ph. D. in the field of Physical Orgaanic Chemistry from BHU. In 12 years of her teaching and research career she has taught Engineering Chemistry including physical, organic, analytical and inorganic and contributed to the scientific community. Her research expertise is on proton transfer processes, QSAR studies, studies of structure and solvent effects on strength of various substituted acids in apolar aprotic media, Chemometric analysis of structure and solvent effects. She has 13 research papers in international and national journals and in various conference proceedings to her credit. She has also contributed 3 chapters in books of international repute. She has life membership from GCNS ,DU. She was invited from University of Manchester to present her research contribution in 10th International Conference on Materials Chemistry  (MC10); organized by Royal Society of Chemistry at University of Manchester, UK. She is running a BRNS (NUP) project worth Rs. 30lakh of  Bhabha Atomic Research Centre, Trombay, Mumbai. She has been associated with ITS Engineering college since 2007 wholeheartedly with great aplomb. She has the motto to delve new scientific facts that will ameliorate the health and the environment of members of the public. She tries to contribute scientifically for societal and national benefit. Dr. Ruchi loves reading books, playing, and listening to music.",
      "mentor_image": ""
    },
    {
       "mentor_id"="15",
      "mentor_name": "Prof. Vivek Tomar",
      "designation": "Assistant Professor",
      "department": "Applied Sciences and Humanities",
      "description": "An alumnus of Uttar Pradesh Technical University & Amity University, Prof. Vivek Tomar, specializes in Digital Image Watermarking and Software Engineering & Testing. He completed his B.Tech from UPTU, Lucknow and M.Tech from Amity University, Noida campus. His area of research focuses upon Digital Image Watermarking & Machine Learning. He has 10 Years of teaching experience at various levels. He has taught subjects like C Programming, Computer Architecture & Organization, Software Engineering, Testing, Data Mining etc. Prof. Tomar is a life member of ISTE. He has published various research papers in international journals and conferences. His hobbies are Playing & Watching Cricket.",
      "mentor_image": ""
    },
    {
       "mentor_id"="16",
      "mentor_name": "Dr. Preeti Tewari",
      "designation": "Assistant professor",
      "department": "Applied Sciences and Humanities",
      "description": ": Dr Preeti Tewari is a doctorate in English literature(Core research area: Feminist Discourse).She did her Masters in Phonetics and Linguistics from English and Foreign Languages University (earlier known as CIEFL). She has also done Train the Trainer Course and has varied certifications in Soft Skills, BEC training and Human Values and Professional Ethics from institutions like, Infosys, Cambridge University, the British Council and Dr APJAKTU. She has 16 years of enriching experience in teaching and training. She has taught an array of courses like Professional Communication, English Proficiency, Business Communication, Technical Writing, UCLES BEC and Soft Skills courses to the undergraduate as well as post graduate students. She trained a group of govt. employees in Business Communication too at UPTEC. She has published prolifically in Journals/Conference proceedings of National and International repute. Her research interests include the areas of Applied Linguistics, ELT, Phonetics, Business Communication, Corporate Communication, Soft Skills training and Feminism. Dr Tewari has recently authored a book too. Besides teaching and training, she has a keen penchant for theatre and music.",
      "mentor_image": ""
    }
  ]
}
